// 1 Задание

// let a = 10;
// alert(a);
// a = 20
// alert(a);

////////////////////////////////////////////

// 2 Задание

// let firstIphoneDate = 2007;
// alert(`Дата выпуска первого Айфона: ${firstIphoneDate}`);

////////////////////////////////////////////

// 3 Задание

// let jsCreator = "Brendan Eich";
// alert(`Создателем языка JavaScript является ${jsCreator}`)

////////////////////////////////////////////

// 4 Задание

// let num1 = 10;
// let num2 = 2;

// sumRes = num1 + num2;
// diffRes = num1 - num2;
// multRes = num1 * num2;
// divRes = num1 / num2;

// alert(`10 + 2 = ${sumRes}`);
// alert(`10 - 2 = ${diffRes}`);
// alert(`10 * 2 = ${multRes}`);
// alert(`10 / 2 = ${divRes}`);

////////////////////////////////////////////

// 5 Задание

// let result = 2 ** 5
// alert(`2 в 5-й степени будет ${result}`);

/////////////////////////////////////////////

// 6 Задание

// let a = 9;
// let b = 2;
// let result = a % b;

// alert(`Остаток от деления ${a} на ${b} будет ${result}`)

/////////////////////////////////////////////

// 7 Задание

// let num = 1;
// num += 5;
// num -= 3;
// num *= 7;
// num /= 3;
// num += 1;
// num -= 1;
// alert(`Окончательный ответ будет ${num}`);

///////////////////////////////////////////////

// 8 Задание

// age = prompt("Сколько вам лет?");
// alert(`Вам ${age} лет`);

///////////////////////////////////////////////

// 9.0 Задание

// const user = {
//     name: "Reha",
//     age: 23,
//     isAdmin: true
// }

// console.log(user);

///////////////////////////////////////

// 9.1 Задание

// user['city of Residence'] = 'Pullman, WA'
// console.log(user);

///////////////////////////////////////

// 9.2 Задание

// user.age = 50;
// console.log(user);

////////////////////////////////////////

// 9.3 Задание

// delete user['city of Residence'];
// console.log(user);

////////////////////////////////////////

// 9.4 Задание

// let info = prompt("Какую информацию хотите узнать o пользователе?");
// alert(user[info]);

////////////////////////////////////////

// 10 Задание

// let clientName = prompt("Введите имя");
// alert(`Привет, ${clientName}!`);
