// 1 задание

// for (let i = 1; i <= 2; i++) {
//     console.log('Привет');
// }

///////////////////////////////////////////

// 2 задание

// let i = 1;

// while (i <= 5) {
//     console.log(i);
//     i++;
// }

///////////////////////////////////////////

// 3 задание

// let i = 7;

// do {
//     console.log(i);
//     i++;
// } while (i <= 22);

///////////////////////////////////////////

// 4 задание

// const obj = {
//     'Коля': '200',
//     'Вася': '300',
//     'Петя': '400'
// }

// for (let key in obj) {
//     console.log(`${key} - зарплата ${obj[key]} долларов`);
// }

///////////////////////////////////////////

// 5 задание

// let n = 1000;
// num = 0;

// do {
//     n /= 2;
//     num++;
// } while (n >= 50);

// console.log(`Число остановиться на ${n}`);
// console.log(`Число итерации - ${num}`);

///////////////////////////////////////////

// 6 задание

// for (let dayNumbers = 5; dayNumbers <= 31; dayNumbers += 7) {
//     console.log(`Сегодня пятница ${dayNumbers}-е число. Необходимо подготовить отчет`);
// }







